SharhadBashar/ECSE-426-Micro-Processors/Lab3_STM32F4Cube_Base_project/Lab3_STM32F4Cube_Base_project/Sources/accelerometer.c
////////////////////////////////////////////////////////////////////////////////
//	File Name					: accelerometer.c
//	Description				: Vode for accelerometer
//	Author						: Sharhad Bashar
//										: Anthony Ubah
//	Date							: Oct 17th, 2016
////////////////////////////////////////////////////////////////////////////////

#include <arm_math.h>
#include "stm32f4xx_hal.h"
//#include "stm32f4xx_hal_def.h"

#include <LIS3DSH.h>
#include <accelerometer.h>
#include <math.h>
//uint8_t acc_flag = 0;

void acc_init(void){
	LIS3DSH_InitTypeDef acc_struct;
	LIS3DSH_DRYInterruptConfigTypeDef acc_int_struct;
	GPIO_InitTypeDef acc_int_GPIO_struct;

	acc_struct.Power_Mode_Output_DataRate 	= LIS3DSH_DATARATE_25;
	acc_struct.Axes_Enable 									= LIS3DSH_XYZ_ENABLE;
	acc_struct.Continous_Update 						= LIS3DSH_ContinousUpdate_Enabled;
	acc_struct.Full_Scale 									= LIS3DSH_FULLSCALE_2;
	acc_struct.AA_Filter_BW 								= LIS3DSH_AA_BW_50;
	acc_struct.Self_Test 										= LIS3DSH_SELFTEST_NORMAL;

	acc_int_struct.Dataready_Interrupt 	= LIS3DSH_DATA_READY_INTERRUPT_ENABLED;
	acc_int_struct.Interrupt_signal 		= LIS3DSH_ACTIVE_HIGH_INTERRUPT_SIGNAL;
	acc_int_struct.Interrupt_type 			= LIS3DSH_INTERRUPT_REQUEST_PULSED; 

	LIS3DSH_Init(&acc_struct);
	LIS3DSH_DataReadyInterruptConfig(&acc_int_struct);

	__HAL_RCC_GPIOE_CLK_ENABLE();
	acc_int_GPIO_struct.Pin = GPIO_PIN_0;
	acc_int_GPIO_struct.Mode = GPIO_MODE_IT_FALLING;
	acc_int_GPIO_struct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	acc_int_GPIO_struct.Pull = GPIO_NOPULL;

	HAL_GPIO_Init (GPIOE, &acc_int_GPIO_struct);

	HAL_NVIC_EnableIRQ(EXTI0_IRQn);
	HAL_NVIC_SetPriority(EXTI0_IRQn,1,2);


}

float pitch_calc(float x, float y, float z){
	float pitch;
	pitch = atan(y/sqrt(x*x + z*z))*(180/PI);
	return pitch;
}

float roll_calc(float x, float y, float z){
	float roll;
	roll = atan(x/sqrt(y*y + z*z))*(180/PI);
	return roll;
}


